Tutorials1/scalarTransportQHDFoam/2D/pitzDaily/0/alphaQGD
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphaQGD;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    inlet
    {
        type		calculated;
        value		$internalField;
    }

    outlet
    {
        type		calculated;
        value		$internalField;
    }

    upperWall
    {
        type		calculated;
        value		$internalField;
    }

    lowerWall
    {
        type		calculated;
        value		$internalField;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
