Tutorials1/scalarTransportQHDFoam/2D/pitzDaily/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    T
    {
        solver          PCG;
        preconditioner
	{  
	    preconditioner GAMG;
            smoother       GaussSeidel;
            relTol         1e-2;
            tolerance      1e-4;
	}
	tolerance	1e-10;
	relTol		0;
    }

    p
    {
        solver          PCG;
        preconditioner
	{  
	    preconditioner GAMG;
            smoother       GaussSeidel;
            relTol         1e-2;
            tolerance      1e-4;
	}
	tolerance	1e-10;
	relTol		0;
    }
}

PISO
{
    nNonOrthogonalCorrectors 0;
    pRefCell		     100;
    pRefValue		     100000;
}


// ************************************************************************* //
